# Урок 3. Данные, функции и модули в Python

## Эксперемент с ASCII - графикой  


     
                                 ,▄▄▄▓▓████████▓▓▄▄,
                             ,▄████████████████████████▄
                            █████╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬████▄
                           ███▒╬╬╬███▒╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╣███
                           ███╬╬╬█████╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬███─
                           ███╬╬╬╬███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬███─
                       ,   ███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬███▄▄▄▄▄╓
                  ▄▓███████████████████████╬╬╬╬╬╬╬╬╬╬╬╬╬████████████▄
                ▓████╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▒░░░░░│╙▀███▄
              ╓███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▒░░░░░░░░│╙███
             ]███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▒░░░░░░░░░░╟██▌
             ███▒╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██░░░░░░░░░░░░███
             ███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▌░░░░░░░░░░░░╟██
            ▐███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓▓█████▀░░░░░░░░░░░░░╟██
            ▐███╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓████▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀╙└░░░░░░░░░░░░░░░╟██
             ███╬╬╬╬╬╬╬╬╬╬╬╬╬██▀└'│││││░││░░░░░░░░░░░░░░░░░░░░░░░░░░░░╟██
             ███╬╬╬╬╬╬╬╬╬╬╬╬██▀││││││░░│░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░███
             ╟███╬╬╬╬╬╬╬╬╬╬╬██│││││░││░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▐██▌
              ███▓╬╬╬╬╬╬╬╬╬╬██│││░││░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄███
               ▀███▓╬╬╬╬╬╬╬╬██│░│░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░,▄███▀
                └▀████████████│░░░░░░░░░░░░█████████████████████████▀
                   └▀▀▀▀▀▀▀███░░░░░░░░░░░░░└└└└└└│││││││╫██▀▀▀▀▀╙└
                           ███░░░░░░░░░░░░░░░░░░░Q▄▄░░░░╫██─
                           ███░░░░░░░░░░░░░░░░░░▓████░░░╫██─
                           ███▄░░░░░░░░░░░░░░░░░╙███▀░░░███─
                            ████▄░░░░░░░░░░░░░░░░░░░░░▄███▀
                             ╙▀█████▄▄▄▄▄▄▄▄▄▄▄▄▄▄▓█████▀─
                                └╙▀▀███████████████▀▀╙─
     
     
     
 
## 1.Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
## Тут предоставлены эксперементы с escape - строках и ASCII - графика
*Пример:*

- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

```python
print(
    '''
_   _   ___   __  __  ___       __      __  ___   ___  _  __         ____ 
| || | / _ \ |  \/  || __|      \ \    / / / _ \ | _ \| |/ /        |__ / 
| __ || (_) || |\/| || _|        \ \/\/ / | (_) ||   /|   <          |_ \ 
|_||_| \___/ |_|  |_||___|        \_/\_/   \___/ |_|_\|_|\_\        |___/ 

    '''

)

print(
    '''
    1.Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
*Пример:*

- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

    '''
)

lost1 = (2,3,5,9,3)
res =0 
for i in range(len(lost1)):
    if i % 2 != 0:
        res += lost1[i]
print('Ответ: ',res)

# Демонстрация escape строк 

print("\t\t\tТабуляция")

print("\t\t\t \\ \\ \\ \\ \\ \\ \\")
print("\t\t\t\tby")
print("\t\t\tМаксиму Сергеевичу")
print("\t\t\t \\ \\ \\ \\ \\ \\ \\")

print("\nОтдельное спасибо хотелось сказать Майклу доусону")

# Должен сработать звуковой сигнал но на mac не работает 
print("\a")

input("\n\nНажмите Enter чтобы выйти.")

```
## 2.Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
*Пример:*

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]

```python


print(
    '''
▄▄   ▄▄ ▄▄▄▄▄▄▄ ▄▄   ▄▄ ▄▄▄▄▄▄▄    ▄     ▄ ▄▄▄▄▄▄▄ ▄▄▄▄▄▄   ▄▄▄   ▄    ▄▄▄▄▄▄▄ 
█  █ █  █       █  █▄█  █       █  █ █ ▄ █ █       █   ▄  █ █   █ █ █  █       █
█  █▄█  █   ▄   █       █    ▄▄▄█  █ ██ ██ █   ▄   █  █ █ █ █   █▄█ █  █▄▄▄    █
█       █  █ █  █       █   █▄▄▄   █       █  █ █  █   █▄▄█▄█      ▄█   ▄▄▄█   █
█   ▄   █  █▄█  █       █    ▄▄▄█  █       █  █▄█  █    ▄▄  █     █▄   █▄▄▄    █
█  █ █  █       █ ██▄██ █   █▄▄▄   █   ▄   █       █   █  █ █    ▄  █   ▄▄▄█   █
█▄▄█ █▄▄█▄▄▄▄▄▄▄█▄█   █▄█▄▄▄▄▄▄▄█  █▄▄█ █▄▄█▄▄▄▄▄▄▄█▄▄▄█  █▄█▄▄▄█ █▄█  █▄▄▄▄▄▄▄█

    '''
)
print(
    '''
    2.Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
*Пример:*

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
    '''
)


from random import randint
#https://python-scripts.com/random?ysclid=l8vtjp16ri763264852


number = int(input('Введите размер списка:  '))
list_1 = [] # счетчик с изменяемым значением 
list_2 = []

for i in range(number): # генерация чисел через list
    list_1.append(randint(0, 9))
    print(list_1)

for i in range(len(list_1)):
    while i < len(list_1)/2 and number > len(list_1)/2:
        number = number - 1
        a = list_1[i] * list_1[number]
        list_2.append(a)
        i += 1

print('Ответ: ',list_1)
print('Ответ: ',list_2)

input("\n\nНажмите Enter чтобы выйти.")
```


## 3.Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
*Пример:*

- [1.1, 1.2, 3.1, 5, 10.01] => 0.19

```python

print(
    '''
    3.Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
*Пример:*

- [1.1, 1.2, 3.1, 5, 10.01] => 0.19
    '''
)

from random import uniform
#import uniform
#Этот метод возвращает вещественное число r такое, что x <= r < y.

n = int(input('Введите размер списка:  '))
list_1 = []
for i in range(n):
    f = uniform(0, 9)
    list_1.append(round(f, 2))

min_1 = list_1[0]
max_1 = 0
for i in range(len(list_1)):
    
    if max_1 < list_1[i]:
        max_1 = list_1[i]
    if min_1 > list_1[i]:
        min_1 = list_1[i]
dif = (max_1 - int(max_1)) - (min_1 - int(min_1))

print('Список: ',list_1)
print('Максимальное число: ',max_1,'Минимальное число: ', min_1)

print(round(dif,2))

input("\n\nНажмите Enter чтобы выйти.")
```
## 4.Напишите программу, которая будет преобразовывать десятичное число в двоичное.
*Пример:*

- 45 -> 101101
- 3 -> 11
- 2 -> 10

```python

print(
    '''
    4.Напишите программу, которая будет преобразовывать десятичное число в двоичное.
*Пример:*

- 45 -> 101101
- 3 -> 11
- 2 -> 10
    '''
)

a = int(input('Введите число: '))
b = ''
while a > 0:
    b = str(a%2) + b
    a = a // 2
print('Ответ: ',b)

input("\n\nНажмите Enter чтобы выйти.")
```
## 5.Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
*Пример:*

- для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи] (https://ru.wikipedia.org/wiki/Негафибоначчи)

```python
print(
    """
    5.Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
*Пример:*

- для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи] (https://ru.wikipedia.org/wiki/Негафибоначчи)
    """
)

f1 = 1
f2 = 1
n = int(input("Введите число: "))

print(f1, f2, end=" ")  # ввывод в одну строку
while n > 2:
    # f1 = f2
    # f2 = f1 + f2
    f1,f2=f2,f1+f2
    print(f2,end=" ")
    n -= 1 #Уменьшаем значение на 1 

input("\n\nНажмите Enter чтобы выйти.")
```