print(
    """
▄▄   ▄▄ ▄▄▄▄▄▄▄ ▄▄   ▄▄ ▄▄▄▄▄▄▄    ▄     ▄ ▄▄▄▄▄▄▄ ▄▄▄▄▄▄   ▄▄▄   ▄    ▄▄▄▄▄▄▄ 
█  █ █  █       █  █▄█  █       █  █ █ ▄ █ █       █   ▄  █ █   █ █ █  █       █
█  █▄█  █   ▄   █       █    ▄▄▄█  █ ██ ██ █   ▄   █  █ █ █ █   █▄█ █  █▄▄▄    █
█       █  █ █  █       █   █▄▄▄   █       █  █ █  █   █▄▄█▄█      ▄█   ▄▄▄█   █
█   ▄   █  █▄█  █       █    ▄▄▄█  █       █  █▄█  █    ▄▄  █     █▄   █▄▄▄    █
█  █ █  █       █ ██▄██ █   █▄▄▄   █   ▄   █       █   █  █ █    ▄  █   ▄▄▄█   █
█▄▄█ █▄▄█▄▄▄▄▄▄▄█▄█   █▄█▄▄▄▄▄▄▄█  █▄▄█ █▄▄█▄▄▄▄▄▄▄█▄▄▄█  █▄█▄▄▄█ █▄█  █▄▄▄▄▄▄▄█

    """
)
print(
    """
    2.Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
*Пример:*

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
    """
)

from random import randint

# https://python-scripts.com/random?ysclid=l8vtjp16ri763264852


number = int(input("Введите размер списка:  "))
list_1 = []  # счетчик с изменяемым значением
list_2 = []

for i in range(number):  # генерация чисел через list
    list_1.append(randint(0, 9))
    print(list_1)

for i in range(len(list_1)):
    while i < len(list_1) / 2 and number > len(list_1) / 2:
        number = number - 1
        a = list_1[i] * list_1[number]
        list_2.append(a)
        i += 1

print("Ответ: ", list_1)
print("Ответ: ", list_2)

input("\n\nНажмите Enter чтобы выйти.")
